[
  {
    "body": "Buyers beware!  This edition is almost certainly an older English translation of CAPITAL (translators Moore and Aveling) and NOT the more recent, superior translation by Ben Fowkes, published by Penguin Books.  Evidently Amazon doesn't now offer that newer translation for sale, except in the Kindle edition.  (You'll notice that nowhere on the copyright page of this edition does it even mention the translators.) The old, Moore and Aveling translation is good as far as it goes, but it is almost certainly in the public domain now. The fly by night publisher of the $9.00 paperback here offered for sale must be raking in the profits, since it has 'acquired' the rights for this edition of CAPITAL for nothing! (If you read the fine print at the bottom of the publisher's blurb by scrolling down to the bottom of the blurb you'll notice that it warns you that the blurb refers to an \"alternate\" paperback edition of the book, NOT the Penguin edition that IS for sale as  a Kindle book. If I were you, I'd consider buying the Kindle book (the price isn't too bad) but WAIT for Amazon the get access again to the Penguin, Ben Fowkes translation in order to buy  a bound copy..", 
    "rating": 3.0, 
    "title": "BUYER BEWARE. NOT THE MOST RECENT TRANSLATION."
  }, 
  {
    "body": "The Kindle edition is garbled.  Random chunks of text are just missing, so that half of one sentence gets joined with half of another sentence.  The result is to make a difficult text impossible.  Penguin should be ashamed to have their company name associated with such a shoddy product.", 
    "rating": 1.0, 
    "title": "Beware of the Kindle Edition"
  }, 
  {
    "body": "The third volume of Das Kapital is a bit more well known than the second and it makes for some interesting, if somewhat dry, reading. This volume has gained notoriety through the works of Bohm-Bawerk who insisted that Marx's theory of value was inconsistent. In the third volume, Marx says that instead of commodities selling at their value per se, they rather sell according to a certain formula that he lays out. Instead f commodities selling at the \"old\" formula of p= v+s+c, now commodities sell at r(v+c)+v+c. Now, such a modification does not alter the dynamics of the capitalist system one whit. Rather, it allows Marx to show how values as such are translated into prices. Rudolf Hilferding wrote an excellent criticism of Bohm-Bawerk's critique which is, alas, rather hard to find now. *whew*Alright, the rest of the volume deals with Marx's theory of rent and his rather short contribution to a theory of credit and banking. once again, Rudolf Hilferding elaborates upon Marx's theory of credit, banking, and \"fictitious capital\" in his work Das Finanzkapital. Written in 1911, it predicted the First World War and was regarded as the fourth/ fifth volume of Capital (the fourth volume of Capital sometimes held as Marx's Theories of Surplus Value, a history of bourgeois economic theory).I hope this has been relatively coherent. All in all, it isn't Daniel Steele or the Da Vinci Code. Nor is it the Leftist equivalent of Mein Kampf. Rather, it's a somewhat dry, but extremely important, economics text, far better than anything Adam Smith ever produced. I recommend it to economics students, Marxian scholars, and anyone seeking an economic justification of socialism. I hope this was of some use to you.", 
    "rating": 4.0, 
    "title": "An Essential Text (if a bit difficult for the lay reader)"
  }, 
  {
    "body": "The sheer depth of what Marx tries to tackle, regardless if one subscribes to it or not, is nothing short of amazing...and is reason alone to (attempt) to read Capital. It is not a bible, and those who treat it as such most likely have not read it. It is a stunningly accurate critique of political economy as it was then and as it has unfolded today. To conclude, for common misconceptions, Capital identifies the many inconsistencies and problems of political economy in the realm of the Capitalist mode of production. What it does not do is outline how to organize and make work a \"socialist\" or centrally planned economy. To say that the decline of the 'socialist' states make Marx and his work obsolete is pure madness.Perhaps the main difficulty, and perhaps even the reason for such misunderstanding and misinterpretation, is that Marx did not build foundations of knowledge in the traditional way. His world is complex, as it should be, and everything relates to everything else. Nothing is viewed in isolation or analyzed individually. At the same time he takes the reader through layers of abstraction in an attempt to reconstruct the real world step by step from a single concept; the dualism of labor and the contradictions which emanatefron it (labor and labor-power). That Marx was able to deduce his entire theory from a single beginning remains one of the most fascinating features of his work. Another important aspect of his analysis is that it broke away from the classical dogma of political economy being confined to a relation of things and things which essentially concealed the complexities of the human element behind them (unfortunately even more characteristic of mainstream economic theory today). Marx was thus able to comprehend the 'laws' of motion of capitalist production, what the classicists failed to complete. while at the same time its limitations as socio-economic system in the continued development of the productive forces of society.Unfortunately, there tends to be a large number of people that have never been exposed to Marx and listen to a small segment of the population that rallies against Marx due to either cold war ideological or dogmatic nonsense - Any serious reader of Capital will clearly see that this work lacks politicized bias infringing on objectivity that has infiltrated most writings today. Not only is it truly exceptional, but it is the most important contribution to economic thought ever. I can only write this general review - a concise overview would be, at my level, impossible.", 
    "rating": 5.0, 
    "title": "Exceptional ."
  }, 
  {
    "body": "thank you", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "At least in the version Amazon downloaded to my Kindle, Volume III is a huge disappointment. In the Table of Contents in parentheses appear the words \"not included in this volume\" next to chapters 46-53. What? Why? Shouldn't this be emblazoned on the Amazon website? INCOMPLETE. CHAPTERS MISSING. So, what's up?", 
    "rating": 2.0, 
    "title": "Chapters Missing. This is not the Penguin Edition on my bookshelf."
  }, 
  {
    "body": "Great edition, except for the paperbackness", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "He warned us about the Evils of Capitalism before it became wide spread. This countries government has convinced us Communism is evil because it fights the systems of oppression Capitalism feeds on!", 
    "rating": 5.0, 
    "title": "He warned us about the Evils of Capitalism before it ..."
  }, 
  {
    "body": "This book is dense, i had to read it for a class.. its not something i would read for leisure but its interesting", 
    "rating": 4.0, 
    "title": "This book is dense, i had to read it ..."
  }, 
  {
    "body": "Classic.", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "A classic!  Great product and fast shipping!", 
    "rating": 5.0, 
    "title": "Great product and fast shipping"
  }, 
  {
    "body": "excellent", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "A very comprehensive compendium . Tough but very readable .", 
    "rating": 5.0, 
    "title": "Capital Vol I , by Karl Marx"
  }, 
  {
    "body": "great book!", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "You need to read all three volumes to understand Capital, you need to read Capital to understand Marx, and you need to read Marx to understand the world--and to help with the crucial theoretical work of figuring out what must be changed to get rid of capitalism and to begin a new, human society. More specifically, Vol. 3 contains the chapters on the tendency of the  rate of profit to fall, and the counter-tendencies, which is essential to understanding the recent economic crisis and the continuing world recession.", 
    "rating": 5.0, 
    "title": "Read Marx, now more than ever"
  }, 
  {
    "body": "A very comprehensive compendium", 
    "rating": 4.0, 
    "title": "Four Stars"
  }, 
  {
    "body": "A very comprehensive compendium", 
    "rating": 4.0, 
    "title": "Four Stars"
  }, 
  {
    "body": "Solid.", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "Thanks it meets my expectation", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "Great edition, recommended for anyone. Awesome introduction, you will find a lot of useful notes and clarifications on the texto", 
    "rating": 4.0, 
    "title": "Great great great"
  }, 
  {
    "body": "It is hard to write a small review.  I can't put 100 pages of notes on this book.  It is a book to help anyone understand how capital works.  Volume two is more about the circulation process.  Please read it and don't quit after chapter 3.  It is a long book and it is somewhat complicated.  David Harvey has written a companion to the book as well as he does a extensive reading of the book that is offered online for free.  It can be obtained through Itunes and his website, davidharvey.org.  You must read this book to understand a whole different form of thinking.  Also for a thorough understanding of this book try to read Alexander Kojeve,  Introduction to the Reading of Hegel: Lectures on Phenomenology of Spirit for a deep understanding of Marxism through a lens of Hegelian thought, Hegel was a teacher of Marx and Mar was a Hegelian thinker.  If you are a historian you need to read Marx's work in order to be a better historian.", 
    "rating": 5.0, 
    "title": "Great Read"
  }, 
  {
    "body": "There is an enormous collection of  valuable information in volume 1 of Marx's Capital.  Volume 1, moreover, serves very effectively as the first of three volumes in which Marx gives truly compelling evidence of his genius -- how else could one author come to terms with this massive account of the reality of capitalist production as Marx uniquely understands it?  While it soon becomes abundantly clear that Marx was a master prose stylist, there is no mistaking the fact that he did not write for the ease and convenience of his readers.  I can't imagine taking the full measure of this volume, much less the two volumes which follow, without the sustained help of explanatory material such as that provided by David Harvey, a veteran American academician who takes Marx very seriously indeed.Without question, even for exceptionally well informed and intellectually capable readers, this book is a bear.  If you invest the substantialamount of time and prodigious effort needed to master it, you will definitely come to understand why Marxists become Marxists, and you may very well become one yourself.  At the very least, you'll see the world differently, and you'll have a firmer grasp on the character of our contemporary world, not just its economic make-up, but in a socially expansive way.  It's hard to imagine anyone reading the book carefully and with a modicum of understanding and coming away with the judgment that this is merely an ideologically motivated, long-winded exercise in willful self-deception and the deception of others.  If you encounter someone who characterized Marx as a willfully wrong-headed ideologue, you may safely assume that you're dealing with someone who has not read Capital.Capital Volume 1 is, in fact, a richly informative and very difficult piece of world-class research.  I imagine that most readers who take its full measure will come back to it again and again.  I can't imagine doing justice to Capital Volume 1 without putting forth the kind of effort that makes for the creation of a life-long connection.  Marx himself claims to have sacrificed his health, happiness, and family to writing the book.  This has the pathetic sound of self-pitying exaggeration.  But given what I know of Marx and the necessarily prodigious demands of the kind of work he produced, I'm sure he's being dispassionately truthful.You may be disappointed to find that Capital is much less polemical than it is rigorously analytical.  That was my first  response.  For the long term, however, I realized the book is a keeper, and I acknowledged that I'd have to look elsewhere for a call-to-arms that is not also embedded in massive learning.  It's true, of course that Marx was an active professional revolutionary, but he was also a world-class scholar with a prodigiously cultivated mind.  Reading Marx makes me want to spend a year or two in the library of the British Museum, where Marx did his best scholarship.Marx and Charles Darwin exchanged fairly frequent correspondence.  Everyone knows that Darwin transformed our understanding of the world and our place in it.  Much the same is true of Marx's contribution to human knowledge.  It's interesting to acknowledge that social and religious conservatism were barriers to the rightful dissemination of both.  That Marx maintained an ongoing relationship with others of undeniable genius, such as Darwin, bespeaks Marx's own intellectual prowess and reflects his status as a wonderfully original thinker.  In his own authentic way, Marx was at least as much a brilliant scientist as Darwin.  Darwin changed the way we thought about ourselves, but Marx changed the way we live.", 
    "rating": 5.0, 
    "title": "Not a polemic but a keeper nonetheless"
  }, 
  {
    "body": "This book surprised me.  I expected a dry, boring, difficult tome that would not interest me in the long run.  I was (mostly) wrong.  Although some of it is quite tedious, some a bit repetitive, and parts that are incomprehensible,there are long stretches -- especially of the historical parts -- that are fascinating and read very well.I loved reading Chapter 10, On the Working Day.  That's where we learn for sure that time is money, and the struggle for limits to the working day are the crux of the class struggle (still going on with hassles over vacation and sick leave, for example). It is the worker's time that gives value to the commodity, and the endless accumulation of commodities is what capitalism is about.  I also liked Chapter 15, on Machinery and Large-Scale Industry (in large part because technological history is something that interests me anyhow). And all of Part 8, \"So-Called Primitive Accumulation,\" was fascinating.  That is where we see the ultimate contradiction of Capitalism, its dependence on perpetually accumulating more, compounded annually, forever.  Such endless growth comes largely from dispossessing others of what they already had, and endless exploitation of the earth's resources, ad infinitum.David Harvey, who has taught Capital Volume 1 at City University of New York for many years said that he has considered teaching the course backwards, beginning at the end with Part 8 so that the students would have the historical context before going into the technical parts.  I think I could also recommend that anyone undertaking Capital to read Part 8 first.  It will surprise you what a really good writer Marx was, when he wanted to be.It takes a lot of guts to launch into a thousand page tome, written 150 years ago on one of the driest, most dismal of all subjects: political economy.  It is for that reason that I used the free on-line lecture series by David Harvey from his course on Marx at City University of New York, and used it as my guide as I went through the book.  Without such a guide, I probably wouldn't have tackled it but with the guide it is more than worth the effort. Buy the Penguin Classics edition of Capital and download the lectures, one at a time and when you are finished you will be far better educated than you are now!", 
    "rating": 4.0, 
    "title": "Surprise!"
  }, 
  {
    "body": "It is difficult to write a review for a book that is so widely known, which so much has been written about, and which inspires such extreme degrees of both love and hatred. I also freely admit that I am far from being an expert in Marxian economics or economics in general (when I have gained more confidence in my understanding of Marxian economics I intend to update my review).There are two main criticisms of Marx that are very often leveled against Capital and against Marx's thought in general that I think are invalid and I would like to get them out of the way at the beginning of my review.The first criticism often leveled against Marx is based on the idea that the failure of the various \"socialist\" states, the various economic difficulties those states faced while they existed, as well as the atrocities that were often committed in Marx's name, constitute irrefutable evidence of the falsity of Marx's main ideas. The point I would make in this regard is that the title of Marx's book is Capital and for good reason. Marx's book is about the functioning and the dynamics of an economy dominated by capital, or the private ownership of the means of production, and the social relations that are inherent to such a system. In other words, Marx's book is about capitalism not about socialism. His analysis of the dynamics of a capitalist society and economy has to be assessed on its own terms and should not be assessed based on the problems faced by, or the relative inefficiencies of, the socialist economies. In my opinion there is much in Marx's analysis of capitalism that is both valid, and often brilliant, and which does not in anyway rely for its validity on the possibility or desirability of a fully planned or state run economy. The fact that such state run economies were prone to serious economic problems, and ultimate failure, does not, therefore, invalidate Marx's analysis of capitalism.The second major objection that is often raised against Marx is that he underestimated capitalisms ability and inherent tendency to raise everyone's standard of living including that of the laborers. People often argue that Marx's thought is largely a reaction against conditions that were prevalent at the time he was writing and during the early phases of the industrial revolution but were not inherent to capitalism per se. They point out that the standard of living for most laborers is much higher today than it was in Marx's time and that the conditions, therefore, for Marx's negative views of capitalism have largely disappeared. We can ignore, for the time being, the question as to whether these improving conditions are the result of an inherent tendency of capitalism or whether they are the result of direct political action in the form of labor laws, welfare programs, and forms of social security.But there are a couple of points I would like to make about this criticism. First, I think Marx would disagree in principle with measuring the effects of capitalism purely in terms of the purchasing power of the lower classes. Marx believed that a social system based on the private ownership of the means of production was inherently exploitative and alienating (and it is possible for the rate of exploitation to rise even as real wages increase). The capital-labor relation in Marx's view is a social relation of dominance which is obscured under capitalism and by bourgeois economics which view the capital-labor relation as being based on free exchange in the labor market. It must always be remembered that Marx's book is not simply an economic treatise in the narrow sense, but is equally a book of sociology, and many of the problems that capitalism raises should be considered sociological as opposed to purely economic.The second point I would make is that Marx believes there is a general tendency in the capitalist mode of production towards crisis and eventual breakdown. This tendency is obscured by certain counter-tendencies but it is still present. Marx does not believe that the periodic crises of capitalism are simply strange anomalies but are inherent within a system that is based on the production and expansion of surplus value, or exchange value, as opposed to use value (for more on this see Law of Accumulation and the Breakdown of the Capitalist system by Henryk Grossmann). Neither of these problems are solved simply by increasing the purchasing power of the lower classes.I do not believe Marx should be immune to criticism. His works and ideas should be picked apart and criticized to exactly the same degree as anyone else's. But these two criticisms are not really criticisms, they are ultimately just excuses for dismissing Marx out of hand, and I do not believe Marx should be dismissed out of hand.Capital is a difficult book. One cannot hope to fully understand it after a single reading. Part of this has to do with Marx's method. Marx attempts to move from the form that wealth takes in capitalist society (an immense mass of commodities) through the value form and the social relations that lie behind the value form in an effort to analyze the specific nature of capitalist society and its dynamics. The value form, for example, assumes that commodities are produced for exchange so one of the earliest sections in Capital is an analysis of the exchange relationship in which commodities are exchanged for money and then money is again exchanged for commodities (C-M-C) a process that mediates the exchange of use-values for consumption which Marx calls the circulation of commodities. The exchange relationship can also assume another form in which money is exchanged for commodities and then exchanged again for more money (M-C-M') a process that valorizes value (adds surplus value which requires the capital-labor relation) and which Marx calls the circulation of capital.What is important in this movement is the way that Marx begins from a simple category (the commodity) analyzes its nature (the commodity divides up into use-value and exchange-value) deduces the social relations lying behind this form (exchange value assumes production by socially isolated units which then exchange their products) and is then able to deduce further social relations (the circulation of capital requires the capital-labor relation in order to valorize value). Marx's goal is fundamentally different from that of a modern Neoclassical economist. The modern Neoclassical economist, when analyzing the exchange relationship, is fundamentally interested in figuring out precisely what determines the quantitative exchange ratios between commodities and believes that the answer lies in supply and demand. Marx, on the other hand, is interested in determining the social relations that lie behind the commodity form in the first place and in determining the factors which determine supply and demand themselves and which give rise to the specific dynamic (or laws of motion for lack of a better term) of capitalist society (Marx would not necessarily deny that supply and demand determine exchange ratios but he would go onto ask: what determines supply? and would answer: the productive forces of society or socially necessary labor time (they are inversely related); and then again: what determines the productive forces of society and socially necessary labor time? answer: the competition between capitalists over the distribution of surplus-value which drives them to develop labor saving production techniques in order to undercut their competitors, etc.). Marx is interested in analyzing what he takes to be the deeper forces that underlie the surface phenomena of supply and demand and relative prices. Supply and demand curves as they are ordinarily presented in economics textbooks are point in time measurements which take a number of exogenous factors as given. Marx is less interested in determining what the point in time quantitative exchange ratios between commodities are and more interested in analyzing the movements which give rise to changes in the exogenous factors that are taken as given in supply and demand analysis (the factors which lead to shifts in the supply and demand schedules).This is no doubt an inadequate sketch of Marx's method and goals in Capital. It is inadequate due to limitations in my own understanding and due to limitations of space. But I believe many criticisms of Marx are based on a failure to understand the distinctiveness of his method and his goals (at least when measured against the methods and goals of modern Neoclassical economics). So it is definitely worthwhile keeping all of this in mind when approaching Marx if your goal is to reach an honest assessment of the value (or lack thereof) of his contribution to economic thought.", 
    "rating": 5.0, 
    "title": "Marx's Capital"
  }, 
  {
    "body": "Karl Marx definitley lived in a different world than today. \"Capital\" is based on a working environment for the average worker where exploitation was rife, and which I have not experienced in my life. Furthermore, his views on how the capitlist earn (or in his view, not earn) a living is simplistic and probably not relevant anymore. He also denies the possibility that money should earn interest because it has value to borrow money for investment. Perhaps from Marx's point of view I am trapped by capitalist thinking and as such I would be too deluded to follow his argument. Similarly the book is very long winded and explains the same point again and again, and some chapters even re-use previous arguments with very similar language, giving the reader occasional deja-vu experiences. Perhaps I am unconsciously comparing the book to the one by Friedrich Engels (on the working conditions of the English working class) which was excellent. Frankly, \"Capital\" by Karl Marx dissapointed me a little.", 
    "rating": 3.0, 
    "title": "Is Capital by Karl Marx still relevant today?"
  }, 
  {
    "body": "Capital Volume III completes Marx's unrivaled trifecta. Upon completing Vol I-III of Capital, one underground rumor is shown to be true, and another is not. First the correct rumor: the reader will arise from his study reborn into an invulnerable phoenix! Now for the incorrect rumor: with outstretched wings, your flight will not be too close to the sun, as Icarus found out, for Marxian phoenix wings are not made of feathers and wax, but knowledge, sweat, and blood! Marx remarked of Capital Vol I, that \"there is no royal road to science, and only those who do not dread the fatiguing climb of its steep paths have a chance of gaining its luminous summits,\" what he did not inform the reader is that those who climb all three luminous summits will cease need to climb at all! Soaring above the (theoretical) world is now readily at their disposal!In Volume III all the questions, literally all of them, that the reader is left with in regards to Vol I are answered. One might wonder upon completing Vol I, why places that employ no labor (e.g., laundry mats), or places that employ less labor - which is the source of surplus value - than others in the same industry, are able to derive such larger profits. One might also wonder what the role of monopoly or inter-corporate collusion will do to prices. And again, one may wonder further what role supply and demand have upon price and value, since it's ignored in Vol I, yet it is intuitively obviously it must play some role. Marx addresses all of these questions and more (e.g., the answer to the meaning of life, whether or not chocolate is better than strawberry, and the final digit in π (pi)!)Seriously though, despite the hyperbole, Marx does address numerous questions which the reader is left with after completing Vol I. Some of the primary discussions emphasized in Vol III deal with the transformation problem, and also the share of profits across common industries. The reader learns in Vol I that unnecessary labor is the source of profit/surplus value, and because it is unnecessary it's clearly exploitation. This means that the more people work in accords with socially necessary labor time, the more the capitalist can generate a profit. But in a globalized economy, or even within a nation, it's clear that some places employ more workers than others, and the profits between these competing firms do not mesh with Marx's theory in Vol I. Of course people also rarely take the time to see how Marx addressed this issue in Vol III. Marx points out those industrial investments are made by the capitalist class as a whole, so we cannot analyze anyone sectors surplus in relation to their constant and variable capital (S/C+V) and expect for the numbers to all align. Instead we have to look at the S/C+V in relation to that entire sector of the economy, and that will give us the rate of profit in general. Since investments are made by the capitalist class as a whole and consumption is therefore done on this wider basis. But this leads each industry to try to cut down on cost, reducing their work force, and trying to increase productivity and exhaust or invest in newer and more efficient constant capital. Thus the race to the top by each firm is in fact the race to the bottom for the capitalist class overall!This leads to Marx's theory of crisis, which is frequently misread, maligned, or completely ignored and brushed aside. Although Marx referred to the theory as the law of the tendency of the fall in the rate of profit, which leads readers to believe that there is a law in the interworkings of capitalism that mandates the rate of profit to fall constantly, he also offered six counteracting tendencies to the rate of profit. These six counteracting tendencies are increasing the rate of exploitation, depressing wages, cheapening the elements of constant capital, relative over population, foreign trade, and the increase of stock capital. So for all those people who point to any one year, or series of years in capitalism and claim \"look Marx was wrong, profits haven't fallen,\" they best check the previously mentioned six tendencies. As Michael Roberts, among others, have pointed out, the year before any crisis, it does turn out that there is a rise in the organic composition (C and V) of capital (i.e., more C than V), which does in fact prove Marx's point overall.The other intriguing element of Vol III is the discussion of credit, finance, securities, banks, etc. It's quite overwhelming the degree to which Marx's predictions in Vol III have come true in regards to the modern finance industry and financial capital in general. Every day we hear things like Wall Street is making record profits, and the price and amount of securities have never been higher! Yet we see that Wall Street is sitting on their money and failing to invest it in anything productive. How can we call this profit then, if profit is derived from exploited labor? In fact this is fictitious capital, or potential money capital, which presently sits idle.  For those who say Wall Street is making record profits, they are fetishizing finance, and failing to get at the essence of the capitalist system.Marx also deals with merchants' capital in this book, and the role of exploitation in regards to the employees of merchants' capital (e.g., wal mart or publix employees). Are they exploited? They seem underpaid, yet they do not engage in productive labor. In fact they are exploited in a sense. As Marx points out, merchants in buying up products en masse get it at less than its produced value, and they derive a profit by selling the products at their actual value. But the merchants don't actually do a lot of work. The Walton family certainly doesn't do a whole lot of work for their income. It is the employees of merchants' capital (the truck drivers, the shelf stockers, the cashiers) that help these merchants realize the value difference between their purchase of bulk commodities, and their sale. And yet they are not compensated for the overall difference, ergo they are exploited too.In sum, I've hardly covered the primary details laid out in Vol III. And Capital Vol III is every bit as important now, if not more so, than it was when Engel's published it toward the end of the 19th century. It is also every bit as important as Vol I. One cannot understand capitalism off the first volume alone. It's not exaggeration to say that in order to understand, fully, the capitalist world we live in today, and in order to understand how to overcome, one must read Marx's trilogy. It is not easy task, but the phoenix wings are totally worth the belabored process.", 
    "rating": 5.0, 
    "title": "review"
  }, 
  {
    "body": "Great overview of Capitalism.  This is not a book about Communism.  Although some of his criticism of Capitalism comes through, for the most part he holds himself in check and writes a scholarly analysis.  What I really enjoyed was the historical context his footnotes provide.  Never realized how big of a battle the 8 hour workday was.  How much of a discussion among Industrial Theorist on how to keep a workforce in the factories and how much to pay them.  Many of the arguments of the 1800's eerily reflect contemporary arguments about the workforce.  A good read if a bit wordy.", 
    "rating": 5.0, 
    "title": "Great overview of Capitalism"
  }, 
  {
    "body": "I've been trying to read this for a long time.  I downloaded the free version then the $.99 and they were tough to read. The translation just made it harder to read.  With this version I can honestly say that I am learning more about his ideals and the rationale behind them.  Still, this is not and easy read and can become very dry at times.  One thing that I have noticed is that it is redundant.  What he says in 10 pages could have been easily summarized in 2-3.  The introduction by Ernest Mandel is enjoyable to read. I would highly recommend this to anyone attempting to understand Marx and his ideologies.", 
    "rating": 4.0, 
    "title": "The best version that I have found"
  }, 
  {
    "body": "A oldie but a goldie.  Hard going in some places, but worth the effort.  LSE has a multipart reading class covering Das Kapital on YouTube.  Offers a new perspective on many of today's situations.  With the on-going robot invasion, the Labor Theory of Value will have to be revised.", 
    "rating": 5.0, 
    "title": "Like it or not, this is one of the foundational documents of our time."
  }, 
  {
    "body": "You can't read this book like anyother book and breeze thur,  each paragraph must  be carefully read studied then digested because this book is filled with knowledge beyond our current economic status. Meaning we as a civilization of laws and technology haven't evolved yet to appreciate and understand then put to use all the benefits of Marx theories", 
    "rating": 5.0, 
    "title": "You can't read this book like anyother book and breeze thur"
  }, 
  {
    "body": "I could write 10 pages on my specific agreements and disagreements with Marx's economics analysis, but this isn't the place for that. I guess more than anything else I've got two lingering reactions. First, I wanna grab Karl Marx by the shoulders, shake him, and tell him that, however much physics envy he's got (\"the rate and mass of surplus value\"), he cannot make economics into a science, and that even if he could he wouldn't be able to write the authoritative foundational text for that science by just theorizing abstractly without doing any experiments. Second, I want to thank and congratulate him for his automatic, human and above all honest identification with the struggle of the working against the capitalist classes, which I found indescribably refreshing after earning an econ degree from a neoliberal department where the norm was to take the opposite orientation and then clothe it in depoliticizing claims of objectivity.I was surprised by how often the great anti-capitalist agreed completely with capitalist orthodoxy, for example on the production benefits and human costs of the division of labor or on the need for money as a medium of exchange.  I thought Marx was at his best when he was most empirical: detailing the horrors of industrial wage slavery in Dickensian Britain and then tracing the contours of the debates on the Factory Acts, especially when he was righteously lacerating the apologists of the factory owners.  And now, just for you, I'm gonna type out the full text of all the parts of this book that deal with Marx's vision for a post-capitalist society, all both of 'em:p. 515fn33: \"The field of application for machinery would therefore be entirely different in a communist society from what it is in a bourgeois society.\"p. 739: \"In this way he spurs on the development of society's productive forces, and the creation of those material conditions of production which alone can form the real basis of a higher form of society, a society in which the full and free development of every individual forms the ruling principle.\"And that's it, two sentences in 1,100 pages.  So anyone who wants to blame Marx for Stalin must seek their evidence elsewhere, possibly in Bakunin.", 
    "rating": 4.0, 
    "title": "A good solid anti-capitalist who thought he was also a scientist"
  }, 
  {
    "body": "It's the original translation to english of Das Kapital, then the best option for those who don't speak german. Unfortunately there isn't a hard cover version of this edition, and as it is a very big book, would be perfet for the longevity of the product.The content.. can be considered a masterpiece as has influenced so many works from both libertarians and socialists, and it's still debated today at schools. I think reading it is essential for anyone who intend to criticise it and/or have a difinite opinion about it.", 
    "rating": 4.0, 
    "title": "It's worth it"
  }, 
  {
    "body": "At the final of this extensive and tough read, the rewards are worth the effort. This third volume of Das Kapital concludes Marx attempt to describe how a Capitalist economic and society works. The most difficult part of it is to follow the concepts and ideas that compose the subject and how the different concepts are related to one another.The most impressive part of all is the scope of the work and how it formulates the inherent flaws and machinations of the capitalist system. Overall, a tough read, but a rewarding experience.", 
    "rating": 5.0, 
    "title": "Impressive and worthy read!"
  }, 
  {
    "body": "In this first volume, the only one the publication of which Marx himself supervised, the structurally contradictory, and hence dynamic and directional, \"deep structure\" of capitalist society is rigorously  explored.  Beginning with the commodity form, he unfolds categorially the  historical logic of capitalism.  In so doing, he criticizes excogitate  philosophy by immanently encompassing and incorporating his own would-be  excogitate exposition of the commodity form itself in the famous first  chapter.  He handles Hegel likewise by translating Hegelian historical  dynamism within the logic of capitalism.  And, of course, there are the  truly brilliant sustained engagements, accountings for, and critiques of  Adam Smith and David Ricordo which are the sites for the most impressive  display of Marx's method.  For therein he accounts for ideology as a  structural feature of the system.  The commodity form \"projects\"  a mode of appearance determinately that is itself deceiving- for instance,  that one confuse the labor of the flesh and blood laborer with the  commodity generative of surplus value, labor power, etc.  This is no  functionalist class-based fact, a point often obscured by the unfortunate  label Marx uses, \"bourgeois economy.\"  Briefly, just to pick up  some typically conventional remarks made about Marx.  This is Marx's  masterpiece, his life's work, the only work that displays fully his  delightfully caustic wit, profoundly penetrating analytical powers, and  stylistic genius.  Forget the utterly bogus crap that still floats in the  American atmosphere like a miasmic stench arising from a McCarthyism that  never really got flushed.  Beuracratic collectivism, the agglutination of  the individual into a mass heap, celebrations of industrial worker heroes,  and all the rest of the distortions that have arisen out of Soviet-style or  Western \"democratic\" advanced industrial states should be checked  at the gate.  Indeed, it is one of the few advantages of this brave new  world that we can at least read Marx in peace and good conscience again  (especially now that it seems that the system fears no enemies- we are free  to pursue every vice and feed our fantasies out whatever utopia just so  long as we make into work on time on Monday morning). Finally, this  translation, though unfortunate at times, offers the advantage of including  at the end an extremely worthwhile appendix of some 150 pages entitled  something like \"Results of the Immediate Process of Production\",  which alone would make it worth the price of the book.  Of course, like  everything else in Capital it cannot be read out of context.  In fact, it  would I think be worthwhile to read it in the position where it was  originally intended to be, after chapter 5, I believe, instead of at the  end.  Regardless, it is crucial that one read the work as a whole.  It  simply cannot be understood from the first section.  After having done so,  should one seek some insightful commentary to unravel some of the many  thorny problems of interpretation one cannot do better than to consult  Marx's own notebooks, the Grundrisse, also available in an affordable  Penguin paperback edition.  The point is, all facile declarations of the  \"objective refutation\" of Marx sloganizing aside (see Fukuyama's  tendentious and second-rate piece of state propoganda, End of History and  the Last Man), all serious criticism of the pathologies of modernity begin  with Marx and even the best of the twentieth century often falls short of  him.", 
    "rating": 5.0, 
    "title": "Deep Structure of a Society"
  }, 
  {
    "body": "This edition contains only half of Volume I.  The text is also filled with strange typos- many pages have a mysterious small \"p\" at the beginning of each paragraph and some paragraphs have random \"g\"s where spaces should go.  Finally, compared to other versions both in print and online, the translation is atrocious and very difficult to read.", 
    "rating": 1.0, 
    "title": "Bad Edition"
  }, 
  {
    "body": "It is annoying to see how other customers denigrate a classical and well-thought book only with untruthful reasons; the book is a jewel of economic and social thought and very heavy on its arguments. It is well introduced by Ernest Mandel and magisterially translated for David Fernbach. It is well laid out and thought-provoking and it should be read after the Grundrisse: Foundations of the Critique of Political Economy (Penguin Classics) and the Early Writings (Penguin Classics) and may be accompanied by a guide or companion of Marxist thought. A classic that will get over the bad facts mistakenly attached to it and that will be a cornerstone in Economic Theories. Remember, in it what is exposed is the weaknesses of capitalism, not a blueprint of bloody revolution and tragic tyranny, as it was made by the betrayers and corrupters that manage to make it happen like that.", 
    "rating": 5.0, 
    "title": "More than a classic--a Magnificent Work!!"
  }, 
  {
    "body": "Believing this to be a place for book reviews, not a political blog; noting that this is one of the most influential books ever written and very well written at that; admiring the brilliant translation by Ben Fowkes; and finding the 70-page introduction by the Marxist economist Ernest Mandel a tour de force in itself; I happily give this book the highest possible rating and recommendation.", 
    "rating": 5.0, 
    "title": "Superb edition of one of the most influential books ever written"
  }, 
  {
    "body": "I'd rate this book five stars if it weren't for one major issue. The book is not very durable, even by paperback standards. The cover rips easily so be very careful when handling if you want to keep your book looking new.", 
    "rating": 4.0, 
    "title": "The cover rips easily so be very careful when handling if you want ..."
  }, 
  {
    "body": "Amazing work. Too bad the Åmericans, Russians, and Chinese managed to pervert it so badly these last 80 years. Reading this is like the scene from The Matrix when Neo wakes up and sees in all its horrible glory the fact that he's been a slave to monsters all his life.Let's have a clear understanding of what Marx was all about:Marx taught that Capitalism is just a product of very cruel social relations, and that these relations are simply a more subtle form of the old lord/vassal ones from the Middle Ages. It's not the reflection of any kind of cosmic law. It was born, it lives, and one day it will die. Everything he writes follows upon that premise. More importantly, he calls things exactly as he see them. Like Trotsky decades later, he has no problem giving Capitalism credit where it's due. While personally a fanatic, Marx nevertheless largely managed to segregate this facet of his personality from his intellectual explorations, and where he fails it's easy to detect.There's no control of religion here.There's no control of free speech.There's no sappy \"socialism.\" You'd be able to work as hard as you like in a Communist society, and it can be easily arranged for you to be compensated for that. You'd be able to rise to a position of authority -- and be compensated for that as well. This is what Communism's all about after all -- paying you what you're worth. You just can't steal the time and energy of your fellow workers like Capitalism allows.He'd even be opposed to price controls. A commodity can, should, must, and in fact WILL (in the long run) cost exactly as much as it's worth. Otherwise you may as well be go back to Capitalism where you can steal the fruit of people's labor with manic abandon.Marx is a giant in the history of economic thought, resting solidly on the foundations laid by titans such as David Ricardo and Adam Smith, and moves grandly within the natural flow of western tradition and civilization. There's nothing here people like Benjamin Franklin (whom he quotes warmly at least three times in this book), Shakespeare, and Aristotle wouldn't appreciate.Anyone who's read this book knows exactly what I'm talking about.Bring your thinking cap, though, 'cause this book's hard. Especially since you have to unlearn everything you've been taught all your life. Remember -- the Matrix (or to use a more traditional metaphor: Plato's cave) has you. And most people would rather shoot you than be dragged out of it. So read it. And Educate! Educate! Educate!", 
    "rating": 5.0, 
    "title": "It takes a brain..."
  }, 
  {
    "body": "This is the version David Harvey uses for his video series. As a teaching aide, this is indispensable.", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "to know what other theories of the political economy existed beyond the parent to modern Capitalism (Adam Smith never envisioned corporate capitalism, but only mom-and-pop style entrepreneurial capitalism, He actually spoke out publicly against early joint stock corporations as being dangerous to his idea of removing masses of the workers from \"immiseration\" -- a hundred years later Marx points out the \"immiseration\" the workers suffer at least partially due to the system that Smith was leery of.)  Fascinating.", 
    "rating": 5.0, 
    "title": "It is incredibly valuable"
  }, 
  {
    "body": "One thing often overlooked about Karl Marx is that he is an accomplished prose stylist and remarkable rhetorician. Many of his phrases and formulations are well known and frequently employed even now, and reading Marx continues to be a pleasurable experience. Philosophically, Marx remains one of the most original and arresting of nineteenth century thinkers. An assessment of Marx, however, should not focus on the content of particular pronouncements or \"predictions\" (there are in fact precious few of these last in his corpus) but should, rather, engage with the movement of his thought and with the conceptual revolution he initiated. If you want to make that engagement, then Capital is as good a place as any to start. But it entails commitment and risk.It is a platitude, of course, that Marx's \"vision\" of how capitalism would develop has been refuted by history. Of course, this right wing mantra bears little scrutiny. Again,  Marx is valuable not as a body of proposals and concrete prognoses. He provides us, rather, with an ever elastic and dynamic conceptual apparatus; a horizon of understanding that has scarcely been surpassed. In any case, the clichés used to discredit Marx's \"predictions\" are  usually underwritten by a complete misunderstanding of how capitalism now works. Take for example the notion (it is scarcely even that) of the \"disappearing working class\". If one lives in a First World country the \"working class\" may indeed APPEAR to have diminished. Marx, however, would have us go beyond the (ideological) appearance. The pseudo-theorists in the West can afford to babble about the \"disappearing working class\" only because of the very \"invisibility\" of millions of anonymous workers sweating in Third World factories (take a look at your designer labels - the traces are readily discernible). The USA is turning into a country of managerial planning, banking, servicing and so on, while its \"disappearing working class\" is reappearing in places like China, where a large proportion of US products is manufactured in conditions that are ideal for capitalist exploitation. Marx would have understood only too well both this international division of labour AND its ideological masking. If you want to understand (really understand, not just pragmatically from the inside) the dominant economic and political system, then Marx's Capital is simply - and one does not use the word lightly - indispensable.", 
    "rating": 5.0, 
    "title": "Indispensable"
  }, 
  {
    "body": "I would think that Marx has had both good and bad rep and that his detractors and fans have taken his legacy further than it deserved. So how should he be viewed? I submit that there are 4 ways to do so and all of them are mutually important. They are 1) Economic, 2) Intellectual, 3) Political and 4) Moral.Marx based his economic views on the premise that all value of a good produced comes from the labor that goes into it. Intuitively this seems wrong. What of the capital, management, demand (by the way Marx does not like the idea of supply and demand either) etc. Our experience shows that all of these and more play a role in determining what value a thing has. Iteratively the Marxist model of economy then suffers from its imperfect premise. His contention of lack of sustainable profits etc make sense if you agree with his premise but that is not how it shapes out in the modern World. All in all it seems that Marx misses the point about how economy works, and given his incredible intelligence, you wonder why.I think the reason is in the intellectual workings of his mind. Now it appears that most of human experience happens in shades of gray or on a spectrum. Very few things actually are definite \"this or that\". This is particularly true of psychology, sociology and also economics. Perhaps the very fact that so many variables come to bear on any given situation that it would be impossible to reproduce that situation again reliably. Hence much of these fields are understood along a spectrum and minor variation in observation is to be expected from event to event and from time to time. Unfortunately many people tend to think of the World as an absolute. For this, against that, regardless of the circumstances (abortion, death penalty, taxes etc come to mind). Marx takes the notion of value of labor from Adam Smith and particularly David Ricardo and fixates upon it as the only determinant of value of a good. Intellectually it boxes him in an inflexible position where he has to stick to his position. Eventually this inflexibility dooms him.Marx built upon his economic position to develop a political scenario that just did not happen - not sustainably. I think here the folly is not that the position was wrong but rather that when he makes his predictions: \"....exploiters will be expropriated ...\", he never says how it would come about. This would not be so bad if more of his writings actually had some sort of road map of how you get to this utopia, but they don't.Finally, is he as bad as I have made him out to be? Well, you be the judge. This is a man writing at the tail end of the initial experience of the industrial revolution.  He devotes a large part of Capital to vivid descriptions of young children being dragged out of bed at 2 and 3 in the morning to work in horrible factories, of starving mothers giving up their children to horrendous working conditions in phosphorus match factories where they would die within a few years or were horribly afflicted, of terrible lung diseases in potters or resistance to reducing the average work day to a mere 18 hours. He sees all these and cries out. What follows may be flawed but is grounded in a deep human sympathy. And his experience resonates today with us when we think that perhaps the working poor ought to at least get a living wage, or people must not have to make a decision between rent and medicines and children ought not to die because access of healthcare was not affordable.", 
    "rating": 4.0, 
    "title": "A good read for his time and for ours"
  }, 
  {
    "body": "Marx, in one of the greatest works in the history of social science and  philosophy, exposes the real basis for the capitalist class, other's labor!  In a book that manages to put the capitalist era in its place, with mounds  of empirical evidence, Marx also manages to outline a better future, a  economically free, democratic society of  producers, building a world more  free from the kind of violence, exploitation, and destruction that marks  this one.  And to those that say this book is dated, or for those who have  only read Marx \"second-hand\" through capitalist authors, read  this book, investigate the world around you, and see that it hasn't come  very far from the grim potrait presented here.", 
    "rating": 5.0, 
    "title": "The Death of Capitalism!"
  }, 
  {
    "body": "Perhaps one of the most influential literary works to ever see print.  Love him or hate him --- Just read him and don't let anyone else form your opinions for you.", 
    "rating": 5.0, 
    "title": "Don't just listen to what other say, read Marx for yourself"
  }, 
  {
    "body": "Don't read commentaries; read the original (translated). Karl is great, much better than the commentators. The going may be tough but it's worth the effort.", 
    "rating": 5.0, 
    "title": "Das Kapital"
  }, 
  {
    "body": "it gets Jeff Bezos's by the 'short and curlies'", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "Capital Volume 1 is a masterpiece.  However, this particular version is trash, it only includes HALF of capital volume one, AND the publishing quality is atrocious, all of the equations are jumbled up and illegible.", 
    "rating": 1.0, 
    "title": "Do not buy this version"
  }, 
  {
    "body": "Unfortunately I felt there was many mistakes in the text and was unable to comprehend the commentary", 
    "rating": 2.0, 
    "title": "Kind of boring"
  }, 
  {
    "body": "I don't understand why the latter reviews about this book mention that this book did not contribute to economic theory. A critique IS a contribution to economic theory simply because it lets us see the other side of the picture whether it is right or wrong. Adam Smith never got to see the explotation of children and the working factory conditions when he wrote Wealth of Nations. He also never got to see it. Marx, on the other hand, never himself set foot on a factory. Marx should be required reading for any economist. For someone to say Marxist theory are wrong one must FIRST read his book. The same goes for Adam Smith or any philosopher whatsoever.", 
    "rating": 4.0, 
    "title": "INTENDED FOR ECONOMISTS"
  }, 
  {
    "body": "Thanks, Obama.", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "I especially love the chapter on the Primitive Accumulation. It's filled with such great insight that one cannot turn his/her head away from it. How Capitalism came into being in this world through specific and cruel violence, backed by 'law' and 'governments'!", 
    "rating": 5.0, 
    "title": "Full of inspirations"
  }, 
  {
    "body": "I was dissapointed when I recieved me copy to find out that it only contains Parts 1-4. It does not have parts 4-8 like the Penguin Edition or the versions online. If you want the entire work make sure you don't buy this version.", 
    "rating": 3.0, 
    "title": "Incomplete Version"
  }, 
  {
    "body": "If :- Your mum has taught you lots of valuable things (eat your vegetables, be nice to old people and little dogs, don't be late to school, keep a clean nose) but she was never really able to explain why you had to WORK for a living - instead of, you know, just living;- Your teachers packed your head full with all kinds of useful knowledge (about prepositions and adverbs, mineralogy and astrophysics, the reproductive organs of plants, x+2-y=0) but they never told you how exactly PROFITS are made - and why anybody would want to make them anyway;- Your friends and lovers can spend hours yakking about various interesting topics (the latest music machine, videogames, designer shoes, imitation leather sofas, blockbuster movies, pink underwear and cherry flavoured bubble-gum) but they call you a bore and a nitpick whenever you wonder why you're all surrounded by so many COMMODITIES and publicity ads promising you bigger, better and faster useless things.- You often have the impression that some greater truth is lacking in your life (and you've tried all the legal/illegal drugs, exciting TV shows, gurus and psychoanalysts, help-yourself books and bestsellers about kid sorcerers)......Then the time may have come to have a long talk with good old Uncle Karl - the black sheep of the social sciences, the guy nobody likes to mention at social occasions (except in the form of a joke: \"have you heard the one about Karl Marx in Las Vegas?\"), the most misquoted and misinterpreted modern thinker.In \"Capital\", he kindly invites you to break on through to the other side (that's how countercultural he was) and check out what's really happening behind the glitzy appearances of everyday life. You don't even have to be a genius to understand him (it will be enough if you can count to ten without choking). And you might be surprised about how obvious some things will seem after he explains to you about the cage you're sitting in.Of course, mum will probably be broken-hearted and fear that you'll join the next anarcho-pinko-terrorist organization down the block. Your teachers might refer to a vast list of successful anti-Marx books and charity organizations. And your friends and lovers will find you an even greater bore than before.", 
    "rating": 5.0, 
    "title": "Doors of Perception"
  }, 
  {
    "body": "Marx was an extraordinary analyst of economics.  He was a serviceable philosopher, but the problem is that he tried to play prophet.  Capital is worth reading for its insight into the workings of early, unrestrained  capitalism and its recognition of the importance of the trade cycle.  On  the other hand, the prophecies that Marx made were farreaching and  illogical.  It is only in the ambitiousness of his project that Marx fails  to reach the heights of a Hume or a Smith.  Personally, I could not agree  less with the tenets of violence and collectivism laid down by Marx, but  even I cannot ignore the huge contribution that Marx has made to today's  world.", 
    "rating": 4.0, 
    "title": "Overreach of a genius"
  }, 
  {
    "body": "It is a crime that no matter how hard one searches there is NO hardcover edition of this book available, but only these very flimsy editions that turn yellow and brittle in no time. I need a copy of this book that I can use heavily without it falling apart as all penguins and vintage pb's do. Help anybody?", 
    "rating": 3.0, 
    "title": "Extremely important book,of course; but only this flimsy edition. Why is there no hardcover edition available?"
  }, 
  {
    "body": "This is the best English translation, but it ignores Marx's final thoughts embodied in the French edition of Capital.  The French translation was a hack job which required extensive correction, in the course of which Marx made significant additions. For these, you'll either have to learn French or go to a research library for the old Dona Torr translation. Too bad.The introduction by Trotskyist theoretician Ernest Mandel is recommended to insomniacs.", 
    "rating": 5.0, 
    "title": "Good translation, but . . ."
  }, 
  {
    "body": "I am a die hard capitalist.  I beleive in the free market.  I beleive that capitalism invigorates the mind and cuases the individual to succeed where the communist will fail.  Nevertheless I recomment Marx's Kapital because it is an important analysis of the current system of the movement of capital.  His analysis is not full of propoganda the way 'The Manifesto' is, instead it is a logical view of our system, perhaps more of a totallity of the evidence then Adam Smith's own read.  I cannot recommend this read strongly enough to those that call themselves communists for this read will make you shiver as you realize that Marx understood capitalism more then any of his succesors.  Lenin and Mao and Gramsci were mere mice compared to the mind of Marx.  In the final summation when one has read all three volumes of Kapital(the third is unfinished) one will come to find that present day Communists have misinterpreted the view of Marx.  The reality is that the command economies of the soviet bloc alienated the workers from their labour more so then capitalism for it stole from them the earning that come with hard work and reduced the workers to slaves, something Marx would have felt was monstrous.  Read this book and you will not be a Communist, instead you will be born a Capitalis anew with a view towards reightous capitalism in which all are rewarded for their work.", 
    "rating": 5.0, 
    "title": "ok ok so I'm a communist at heart"
  }, 
  {
    "body": "good tranaction", 
    "rating": 5.0, 
    "title": "Five Stars"
  }, 
  {
    "body": "I wont talk about its content because im not Marxist and i dont want to oppose his ideas, neither support them.(If you want to know what is the purpose of the book, you can read the first 5 pages en googlebooks)I bought this book for my classical theory class and compared to the Communist Manifesto, Capital I is easiest to understand, and more interesting too. Youcan find better examples for his dialectical materialism. If you are very into Marx and his work, this book is a must for you", 
    "rating": 4.0, 
    "title": "Better than the Manifesto"
  }
]